const poemData = [
  {
    "title": "送唐王川普",
    "date": "2020-11-12",
    "event": "USA current president Trump doesn't want to face h",
    "content": "满江红"
  },
  {
    "title": "红烧野生海螃蟹",
    "date": "2020-11-27",
    "event": "海边抓到两只大螃蟹，红烧香辣蟹一大盘端出，很香，诗性来也",
    "content": "四言绝句"
  },
  {
    "title": "海边钓捞螃蟹记- 外 两首",
    "date": "2020-12-03",
    "event": "由于新冠疫情，为安全起见只好利用清晨没人时前去海边蒱捞螃蟹，抓到两只大七寸的，很高兴，诗一首祝兴",
    "content": "四言绝句"
  },
  {
    "title": "新冠疫情宅家中",
    "date": "2020-04-10",
    "event": "新冠居家隔离记-1",
    "content": "四言绝句"
  },
  {
    "title": "新冠突起人心惶",
    "date": "2020-03-20",
    "event": "新冠居家隔离记-2",
    "content": "四言绝句"
  },
  {
    "title": "海边钓蟹卸心冠烦",
    "date": "2020-12-09",
    "event": "新冠居家隔离记-3",
    "content": "五言旁句"
  },
  {
    "title": "川普的“聪明累”",
    "date": "2020-12-11",
    "event": "看到美国最高法院驳回得州选举诉讼，想起《红楼梦》里的“聪明累”",
    "content": "满江红"
  },
  {
    "title": "川普连任梦碎",
    "date": "2020-12-11",
    "event": "懂王败",
    "content": "四言绝句"
  },
  {
    "title": "川普泪",
    "date": "2020-12-13",
    "event": "美国高院驳回川普的起诉拜登选举违宪一案，使川普翻盘选举结果更加无望，只能泪往肚里流了",
    "content": "四言绝句"
  },
  {
    "title": "岁末感怀",
    "date": "2020-12-31",
    "event": "2020 12月31日，晚4：00 到海边拉螃蟹，看到那山上万家灯火，感怀2020年的不易",
    "content": "四言绝·句 外二首"
  },
  {
    "title": "2021 新年祝福",
    "date": "2021-01-01",
    "event": "2021 新年贺",
    "content": "自由体"
  },
  {
    "title": "致川普",
    "date": "2021-01-06",
    "event": "一月六号川普煽动美国民众冲击正在开确认拜登当选总统的国回会议，造成5人死忙，包括一名警察",
    "content": "七律"
  },
  {
    "title": "叹川普连任梦碎",
    "date": "2020-11-12",
    "event": "一月六号川普煽动美国民众冲击正在开确认拜登当选总统的国回会议，川普连任梦碎",
    "content": "自由体"
  },
  {
    "title": "新冠封城有感",
    "date": "2019-03-01",
    "event": "BC省突然发出封城，停产停市令。使市民大为恐慌，抢购生活物品。一度导致卫生纸脱销。",
    "content": "四言律诗-作者：Rose"
  },
  {
    "title": "送正钧",
    "date": "2021-01-17",
    "event": "帮明发（表兄）送中学同桌同学写诗捉笔",
    "content": "七言律诗"
  },
  {
    "title": "加拿大新上任总里卡尼今天访问北京",
    "date": "2026-01-15",
    "event": "十几年后，美国懂王二进宫，不但重掀起贸易战，还想扩疆土，把加拿大变成美国第 51州。废除美墨加三国协",
    "content": "满江红"
  },
  {
    "title": "回国",
    "date": "2026-01-11",
    "event": "回国-蛇口",
    "content": "自由体"
  },
  {
    "title": "游四海公园-Serkou Park",
    "date": "2025-03-01",
    "event": "游四海公园",
    "content": "free style"
  },
  {
    "title": "司机见懂王-1",
    "date": "2025-03-03",
    "event": "司机见懂王-1",
    "content": "free stlye"
  },
  {
    "title": "司机见懂王-2",
    "date": "2025-03-03",
    "event": "司机见懂王-2",
    "content": "江城子"
  },
  {
    "title": "懂王发起贸易战",
    "date": "2025-04-26",
    "event": "懂王发起贸易战",
    "content": "江城子"
  },
];