const poemData = [
  {
    "title": "送唐王川普",
    "content": "挥手今且别，\n四年来，大千世界，被我搅黑\n美国优先退群友，贸易战火正烈 中国怒，盟邦不悦 自鸣得意股指涨 却新冠瘟疫狰如铁 恰碰得，满头血  大选一夜 惊 望天裂  望荧幕纵横交错， 红蓝易色 怒欲翻盘诉讼起，恐难赢得判决  望窗外， 萧萧落叶  本想官司缠到底， 怕朋党皆弃友尽决  我去也，白翁接"
  },
  {
    "title": "红烧野生海螃蟹",
    "content": "两只螃蟹炒葱姜，金锅铁铲武火炀。涎水岂垂单色秀，红酒相伴醉梦乡。"
  },
  {
    "title": "海边钓捞螃蟹记- 外 两首",
    "content": "1. 旭日东升☺雾锁天， 海边钓蟹没得闲。尽管时时笼中空，会有大蟹笑开言                                                                                                                                                                                                                                                                2.     旭日初升雾尚浓，奋力抛笼入水中。 多时常叹蟹儿小，总把希望寄下笼。（7:56am, Dec 5,2020)"
  },
  {
    "title": "新冠疫情宅家中",
    "content": "不只新冠几时休， 无奈宅家独自愁。 万业皆下暂停键，维有樱花竞自由。"
  },
  {
    "title": "新冠突起人心惶",
    "content": "新冠疫情正发狂，从百到千几天长。 政府下达紧急令， 民众突赶心发慌。                                                                                                                                                                                                                                                                            商场门外排长队， 限购货架早扫光。 我自醉眼赏樱花，懒得去作从众🐏羊。"
  },
  {
    "title": "海边钓蟹卸心冠烦",
    "content": "宅家躲疫心意烦， 海边钓蟹偷清闲。阴晴变换不觉寒， 盼大蟹， 奋力抛笼求更远。                                                                                                                                                                                                                                                          海豹起舞水欢，海鸥吟唱鹰🦅作伴。 钓鱼台上人不少，耐心盼， 偶上大蟹笑开言。"
  },
  {
    "title": "川普的“聪明累”",
    "content": "机关算尽太聪明， 反将几颜面丢尽。  选举不服输， 诉讼没得停，         高发有令，终有了得州诉讼不预审。 枉费了，意悬悬四年心。                好一似， 荡悠悠三更梦。                                                                                        忽喇喇似大厦倾， 昏惨惨似灯将尽。                                                                 呀，一场欢喜忽悲辛，                                                                                             叹人世， 终难定。"
  },
  {
    "title": "川普连任梦碎",
    "content": "忽闻高院令一则，得州诉讼不予接。 大选输赢早已定， 川普连任梦已绝。"
  },
  {
    "title": "川普泪",
    "content": "我输拜登怎心甘，  砸下重金欲翻盘 。                                                                     千宗诉讼无人理 ，律师法官皆智残。"
  },
  {
    "title": "岁末感怀",
    "content": "爱您爱您总算完，身居北美躲疫烦。                                                                   新冠一波又一波，病死饿死两相难。                                                                                                                                                                                                            愁似浮云遮望眼，万家灯火几家欢。                                                                  渴盼疫苗驱瘟神，普天同庆再团圆。"
  },
  {
    "title": "2021 新年祝福",
    "content": "洁白的瑞雪， 渲染了大地的景色，苍松翠柏万物，迎接着晶莹雪花的飘落。                                                                                                                              忙碌的至亲，请稍作停歇。驻足观20满天星斗，回味过往五味杂陈的岁月。                                                                                                                              疫情的肆lu'e"
  },
  {
    "title": "致川普",
    "content": "化府滨街起苍黄，十万川粉上战场。国会山庄今非昔，参众两院已输光。 唐王剩勇成穷寇，连任一梦成黄梁。人若无情天意志，众叛亲离显苍桑。"
  },
  {
    "title": "叹川普连任梦碎",
    "content": "日夜老相思，挽歌玄已断。国会山庄狼烟起，连任梦难圆。无赖已致极，亲离众相叛。终朝了确君王事，只好仰天叹。"
  },
  {
    "title": "新冠封城有感",
    "content": "新冠疫情突发狂，成千上万数日间。政府慌忙急封城，民众不只怎逃芒。商场门外排长龙，货物限购秒扫光。静坐家中望窗外，严阵已待抗新冠。Zhui"
  },
  {
    "title": "送正钧",
    "content": "时光飞逝五十年，同桌相伴似昨天。少时音容萦脑海，恩师教诲在耳眠。人生能有几度春，微信互侯一键牵。且望他日再相会，换盏推杯叙当年"
  },
  {
    "title": "加拿大新上任总里卡尼今天访问北京",
    "content": "加国乱土豆，十年祸跟留，凭借父荫，自由党内喜出头,大麻同婚合法\n经济一塌糊涂\n惹得众人怒\n老婆跟人走\n下台灰溜溜\n\n董王税\n国变州\n万事愁\n卡尼上台\n欲振山河把名留\n加大基建投资\n打通省际物流\n国民有盼头\n访中谋大计\n且把关系修"
  },
  {
    "title": "回国",
    "content": "万里孤行回蛇口\n房依旧 满尘垢\n冰箱空荡 铁锅已生锈\n年前被褥汗渍留\n大扫除 挽起袖\n\n且到超市把物购\n买排骨，炖莲藕\n炒俩小菜 伴来二两酒\n忙完琐事把书读\n赋闲篇 乐悠悠"
  },
  {
    "title": "Serkou Park",
    "content": "金牛奋踢显神威\n银螺昂首映朝晖\n风送花香迎雾起\n柳摇倩影拌霞归\n\n弯月廊下棋牌乐\n荔枝林里歌舞飞\n游人如织心盎然\n胜景更比天堂美"
  },
  {
    "title": "Burnaby",
    "content": "泽伦白宫见董王\n不张扬， 着便装\n万斯点火，争吵难收场\n本欲谋约期有果\n谈不拢，美失望\n\n董王欺人把势仗\n快还钱， 抵家当\n泽伦强驳，援助何需償\n乌忧安全无保障\n美不让，剩愁肠"
  },
  {
    "title": "Burnaby",
    "content": "泽伦白宫戏上场\n要安全， 要保障\n董王优先，安全我无妨\n拜登老朽费公帑\n我索回，理应当\n\n董王欺人把势仗\n快还钱，交家当\n安全保障，去找欧盟商\n我只要你稀土矿\n你不让，快离场"
  },
  {
    "title": "Burnaby",
    "content": "老川喜当万税王\n先气车，后铝钢。\n盟友小第无不心发荒\n草台班子马屁响\n齐赞扬，懂王棒。\n\n懂王得意关税棒，\n杀全球，股债慌，\n小国无奈，跪地求给赏。\n唯有龙国志气昂，\n越加税，越硬刚"
  },
];